-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Dec 11, 2022 at 04:47 PM
-- Server version: 10.4.24-MariaDB
-- PHP Version: 8.1.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `fullcalendar3`
--

-- --------------------------------------------------------

--
-- Table structure for table `schools`
--

CREATE TABLE `schools` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `level_id` bigint(20) UNSIGNED NOT NULL,
  `director` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `mobile` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `idcard` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `schools`
--

INSERT INTO `schools` (`id`, `name`, `level_id`, `director`, `mobile`, `idcard`, `created_at`, `updated_at`) VALUES
(1, 'ابتدائية  ذوالنورين', 1, 'صالح عبدالوهاب إبراهيم جراد', '966563316730    ', '1012972558', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(2, 'ابتدائية الأمير محمد بن ناصر', 1, 'محمد ولي عمر مغفوري', '966506762931    ', '1064673898', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(3, 'ابتدائية السعودية', 1, 'علي احمد مطهر علي ناشب', '966503739384    ', '1063190480', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(4, 'ابتدائية السويس', 1, 'خالد محمد علي شراحيلي', '966554577223    ', '1021006323', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(5, 'ابتدائية الشواجرة', 1, 'منصور حسين محمد احمديني', '966506784084    ', '1046385264', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(6, 'ابتدائية الشيخ عيسى شماخي لتحفيظ القران الكريم ', 1, 'مروان احمد طاهر زيلع', '966557199955    ', '1065386813', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(7, 'ابتدائية العشوة', 1, 'ناصر موسي محمد محرق', '966502725355    ', '1072489527', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(8, 'ابتدائية الفقهاء', 1, 'محمد يحيى احمد مسملي', '966540533323    ', '1041681865', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(9, 'ابتدائية الفيصلية', 1, 'محمد بن عيسي بن رديف شماخي', '966505767710    ', '1026816288', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(10, 'ابتدائية المثنى بن حارثة', 1, 'مروان بن محمد احمد هادي', '966558826783    ', '1045654678', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(11, 'ابتدائية المحمدية', 1, 'توفيق ابكر عقيل آل عقيل', '966505799712    ', '1065235598', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(12, 'ابتدائية المعبوج', 1, 'طيب علي طاهر علا الله', '966535550252    ', '1065099465', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(13, 'ابتدائية المعرفه الأهلية', 1, 'معن أحمد عبده الحربي', '966555770789    ', '1000606499', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(14, 'ابتدائية الملك عبد العزيز', 1, 'عمر صالح علان مبارك', '966551760114    ', '1067787802', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(15, 'ابتدائية الملك عبدالله بن عبدالعزيز', 1, 'موسي حسن أفندي القاسمي', '966567286667    ', '1064243841', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(16, 'ابتدائية بخشة', 1, 'طيب علي طيب عقيلي', '966503099481    ', '1036148516', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(17, 'ابتدائية بدر بالمقارية', 1, 'عبدالعزيز بن إبراهيم طياش', '966556555914    ', '1038690283', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(18, 'ابتدائية حي الجبل', 1, 'احمد علي هادي خرمي', '966506765062    ', '1066074855', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(19, 'ابتدائية خالد بن الوليد', 1, 'عبدالقادر محمد عبدالقادر مصطفى', '966583117667    ', '1056155268', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(20, 'ابتدائية دار التوحيد', 1, 'عبدالقادر محمد عبدالقادر مصطفى', '966583117667    ', '1056155268', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(21, 'ابتدائية دحيقة', 1, 'نايف بن إسماعيل علي محمد سويد', '966555771529    ', '1022862641', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(22, 'ابتدائية رياض جازان العالمية - بنين', 1, 'عبدالغني محمد عبدالله زكري', '966560705555    ', '1028350740', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(23, 'ابتدائية رياض جازان المسار المصري', 1, 'عبدالغني محمد عبدالله زكري', '966560705555    ', '1028350740', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(24, 'ابتدائية سلمان الفارسي', 1, 'بدر بن عبده بن علي عكام', '966562967770    ', '1052658091', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(25, 'ابتدائية طارق بن زياد', 1, 'علي احمد علي حكمي', '966567707705    ', '1047279177', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(26, 'ابتدائية عبدالله بن عباس', 1, 'علي احمد مطهر علي ناشب', '966503739384    ', '1063190480', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(27, 'ابتدائية علوم جازان العالمية', 1, 'علي ابوشملة حسن حكمي', '966535319729    ', '1059203537', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(28, 'ابتدائية علي بن أبي طالب', 1, 'صالح عبدالوهاب إبراهيم جراد', '966563316730    ', '1012972558', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(29, 'ابتدائية عمير والخرادلة', 1, 'خالد علي محمد غزوي', '966505769842    ', '1044411138', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(30, 'ابتدائية محلية', 1, 'علي عثمان احمد كاملي', '966505798395    ', '1052485578', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(31, 'ابتدائية مدارس شركة مستقبل الاحفاد الاهلية', 1, 'ابراهيم علي حسن زكري', '966506763707    ', '1059973568', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(32, 'ابتدائية منارات المجد الاهلية', 1, 'علاء عبده أحمد دراج', '966562805848    ', '1065943548', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(33, 'متوسطة منارات المجد الأهلية', 2, 'علاء عبده أحمد دراج', '966562805848    ', '1065943548', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(34, 'متوسطة معاذ بن جبل', 2, 'خالد محمد علي شراحيلي', '966554577223    ', '1021006323', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(35, 'متوسطة مستقبل الاحفاد الاهلية', 2, 'ابراهيم عبده محمد علي نامس', '966535551049    ', '1051640678', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(36, 'متوسطة محمد بن علي السنوسي', 2, 'عيد محمد علي بكرين', '966500028647    ', '1055052482', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(37, 'متوسطة عمير والخرادلة', 2, 'خالد علي محمد غزوي', '966505769842    ', '1044411138', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(38, 'متوسطة علوم جازان العالمية .', 2, 'علي ابوشملة حسن حكمي', '966535319729    ', '1059203537', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(39, 'متوسطة سلمان الفارسي', 2, 'بدر بن عبده بن علي عكام', '966562967770    ', '1052658091', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(40, 'متوسطة رياض جازان العالمية المصري', 2, 'عبدالغني محمد عبدالله زكري', '966560705555    ', '1028350740', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(41, 'متوسطة رياض جازان العالمية - بنين', 2, 'عبدالغني محمد عبدالله زكري', '966560705555    ', '1028350740', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(42, 'متوسطة دحيقة', 2, 'حسن أحمد محمد فقيه', '966506789094    ', '1064974916', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(43, 'متوسطة دار التوحيد', 2, 'عبدالقادر محمد عبدالقادر مصطفى', '966583117667    ', '1056155268', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(44, 'متوسطة حي الروضة', 2, 'أحمد عبشان أحمد هنيدي', '966565138889    ', '1022799546', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(45, 'متوسطة تحفيظ القران الكريم  بجازان', 2, 'مروان احمد طاهر زيلع', '966557199955    ', '1065386813', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(46, 'متوسطة الملك فهد بمحلية', 2, 'احمد علي سبعي كاملي', '966501470917    ', '1046703029', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(47, 'متوسطة المعهد العلمي بجازان', 2, 'شرف الدين علي احمد كاملي', '966569112208    ', '1051353264', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(48, 'متوسطة المعرفة الاهلية', 2, 'علي أحمد يحي الحازمي', '966594031332    ', '1078277371', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(49, 'متوسطة الفقهاء', 2, 'محمد يحيى احمد مسملي', '966540533323    ', '1041681865', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(50, 'متوسطة الصفا', 2, 'علي احمد علي حكمي', '966567707705    ', '1047279177', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(51, 'متوسطة الشواجرة', 2, 'منصور حسين محمد احمديني', '966506784084    ', '1046385264', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(52, 'متوسطة الأندلس', 2, 'مهدي حسين عثمان مسملي', '966557701022    ', '1026698462', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(53, 'متوسطة الأمير محمد بن ناصر', 2, 'محمد ولي عمر مغفوري', '966506762931    ', '1064673898', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(54, 'متوسطة أبو بكر الصديق', 2, 'مروان بن محمد احمد هادي', '966558826783    ', '1045654678', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(55, 'متوسطة ابن سيناء', 2, 'أحمد بن علي علي خضير', '966540744479    ', '1045516760', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(56, 'ثانوية منارات المجد الاهلية ـ مقررات', 3, 'عبدالرحمن حسن محمد عقدي', '966582565252    ', '1119376166', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(57, 'ثانوية منارات المجد الاهلية ـ - مسارات', 3, 'عبدالرحمن حسن محمد عقدي', '966582565252    ', '1119376166', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(58, 'ثانوية معاذ بن جبل -مقررات', 3, 'عبدالعزيز بن حسن بن محمد ال حسن', '966505768688    ', '1038096119', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(59, 'ثانوية معاذ بن جبل - - مسارات', 3, 'عبدالعزيز بن حسن بن محمد ال حسن', '966505768688    ', '1038096119', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(60, 'ثانوية مستقبل الاحفاد الاهلية - مقررات', 3, 'عبده علاالله عبده خمجان', '966508887754    ', '1048156614', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(61, 'ثانوية مستقبل الاحفاد الاهلية - مسارات', 3, 'عبده علاالله عبده خمجان', '966508887754    ', '1048156614', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(62, 'ثانوية محمد بن علي السنوسي - مقررات', 3, 'عيد محمد علي بكرين', '966500028647    ', '1055052482', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(63, 'ثانوية محمد بن علي السنوسي - مسارات', 3, 'عيد محمد علي بكرين', '966500028647    ', '1055052482', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(64, 'ثانوية عمير والخرادلة - مقررات', 3, 'خالد علي محمد غزوي', '966505769842    ', '1044411138', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(65, 'ثانوية عمير والخرادلة - مسارات', 3, 'خالد علي محمد غزوي', '966505769842    ', '1044411138', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(66, 'ثانوية رياض جازان العالمية - المسار المصري', 3, 'عبدالغني محمد عبدالله زكري', '966560705555    ', '1028350740', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(67, 'ثانوية دحيقة - مقررات', 3, 'حسن أحمد محمد فقيه', '966506789094    ', '1064974916', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(68, 'ثانوية دحيقة - مسارات', 3, 'حسن أحمد محمد فقيه', '966506789094    ', '1064974916', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(69, 'ثانوية الملك فهد بمحلية - مقررات', 3, 'احمد علي سبعي كاملي', '966501470917    ', '1046703029', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(70, 'ثانوية الملك فهد بمحلية - مسارات', 3, 'احمد علي سبعي كاملي', '966501470917    ', '1046703029', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(71, 'ثانوية المعهد العلمي بجازان', 3, 'شرف الدين علي احمد موسى كاملي', '966569112208    ', '1051353264', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(72, 'ثانوية المعرفة الأهلية - مقررات', 3, 'عمر سالم محمد شامي', '966596999970    ', '1066227883', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(73, 'ثانوية المعرفة الأهلية - مسارات', 3, 'عمر سالم محمد شامي', '966596999970    ', '1066227883', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(74, 'ثانوية الكربوس - مقررات', 3, 'حيدر علي فايع مغفوري', '966554570601    ', '1030799884', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(75, 'ثانوية الكربوس - مسارات', 3, 'حيدر علي فايع مغفوري', '966554570601    ', '1030799884', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(76, 'ثانوية الشواجرة - مقررات', 3, 'منصور حسين محمد احمديني', '966506784084    ', '1046385264', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(77, 'ثانوية الشواجرة - مسارات', 3, 'منصور حسين محمد احمديني', '966506784084    ', '1046385264', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(78, 'ثانوية الروضة بجازان - مقررات', 3, 'علي يحيى حسن عقدي', '966505755066    ', '1047300924', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(79, 'ثانوية الروضة بجازان - مسارات', 3, 'علي يحيى حسن عقدي', '966505755066    ', '1047300924', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(80, 'ثانوية الرازي - مقررات', 3, 'وليد بن محمد حسين نمري', '966554791020    ', '1014357667', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(81, 'ثانوية الرازي - مسارات', 3, 'وليد بن محمد حسين نمري', '966554791020    ', '1014357667', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(82, 'ثانوية الخوارزمي - مقررات', 3, 'عصام بن يحيى بن عبدالباري بريك', '966503093460    ', '1045778477', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(83, 'ثانوية الخوارزمي - مسارات', 3, 'عصام بن يحيى بن عبدالباري بريك', '966503093460    ', '1045778477', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(84, 'ثانوية الأمير فيصل بن عبدالله - مقررات', 3, 'خالد محمد علي شراحيلي', '966554577223    ', '1021006323', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(85, 'ثانوية الأمير فيصل بن عبدالله - مسارات', 3, 'خالد محمد علي شراحيلي', '966554577223    ', '1021006323', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(86, 'ابتدائية  ذوالنورين وابتدائية علي بن أبي طالب', 4, 'صالح عبدالوهاب إبراهيم جراد', '966563316730    ', '1012972558', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(87, 'ابتدائية ومتوسطة الأمير محمد بن ناصر', 4, 'محمد ولي عمر مغفوري', '966506762931    ', '1064673898', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(88, 'ابتدائية السعودية وابتدائية عبدالله بن عباس', 4, 'علي احمد مطهر علي ناشب', '966503739384    ', '1063190480', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(89, 'ابتدائية السويس ومتوسطة معاذ بن جبل وثانوية الأمير فيصل بن عبدالله', 4, 'خالد محمد علي شراحيلي', '966554577223    ', '1021006323', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(90, 'ابتدائية ومتوسطة وثانوية الشواجرة', 4, 'منصور حسين محمد احمديني', '966506784084    ', '1046385264', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(91, 'ابتدائية الشيخ عيسى شماخي لتحفيظ القران الكريم ومتوسطة تحفيظ القران الكريم بجازان', 4, 'مروان احمد طاهر زيلع', '966557199955    ', '1065386813', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(92, 'ابتدائية ومتوسطة الفقهاء', 4, 'محمد يحيى احمد مسملي', '966540533323    ', '1041681865', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(93, 'ابتدائية المثنى بن حارثة ومتوسطة أبوبكر الصديق', 4, 'مروان بن محمد احمد هادي', '966558826783    ', '1045654678', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(94, 'ابتدائية خالد بن الوليد وابتدائية ومتوسطة دار التوحيد', 4, 'عبدالقادر محمد عبدالقادر مصطفى', '966583117667    ', '1056155268', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(95, 'ابتدائية ومتوسطة رياض جازان العالمية - بنين', 4, 'عبدالغني محمد عبدالله زكري', '966560705555    ', '1028350740', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(96, 'ابتدائية ومتوسطة سلمان الفارسي', 4, 'بدر بن عبده بن علي عكام', '966562967770    ', '1052658091', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(97, 'ابتدائية طارق بن زياد ومتوسطة الصفا', 4, 'علي احمد علي حكمي', '966567707705    ', '1047279177', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(98, 'ابتدائية ومتوسطة علوم جازان العالمية', 4, 'علي ابوشملة حسن حكمي', '966535319729    ', '1059203537', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(99, 'ابتدائية ومتوسطة وثانوية عمير والخرادلة', 4, 'خالد علي محمد غزوي', '966505769842    ', '1044411138', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(100, 'ابتدائية ومتوسطة منارات المجد الاهلية', 4, 'علاء عبده أحمد دراج', '966562805848    ', '1065943548', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(101, 'متوسطة وثانوية محمد بن علي السنوسي', 4, 'عيد محمد علي بكرين', '966500028647    ', '1055052482', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(102, 'متوسطة وثانوية دحيقة', 4, 'حسن أحمد محمد فقيه', '966506789094    ', '1064974916', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(103, 'متوسطة وثانوية الملك فهد بمحلية', 4, 'احمد علي سبعي كاملي', '966501470917    ', '1046703029', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(104, 'متوسطة وثانوية المعهد العلمي بجازان', 4, 'شرف الدين علي احمد كاملي', '966569112208    ', '1051353264', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(105, 'يوم مكتبي', 5, '', '', '', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(106, 'برنامج تدريبي', 5, '', '', '', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(107, 'إجازة مطولة', 5, '', '', '', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(108, 'مدارس مكتب فرسان', 5, '', '', '', NULL, NULL);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `schools`
--
ALTER TABLE `schools`
  ADD PRIMARY KEY (`id`),
  ADD KEY `schools_level_id_foreign` (`level_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `schools`
--
ALTER TABLE `schools`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=109;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `schools`
--
ALTER TABLE `schools`
  ADD CONSTRAINT `schools_level_id_foreign` FOREIGN KEY (`level_id`) REFERENCES `levels` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
