-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jan 29, 2023 at 07:12 PM
-- Server version: 10.4.24-MariaDB
-- PHP Version: 8.1.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `fullcalendar3`
--

-- --------------------------------------------------------

--
-- Table structure for table `tasks`
--

CREATE TABLE `tasks` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `level_id` bigint(20) UNSIGNED NOT NULL,
  `office_id` bigint(20) UNSIGNED NOT NULL,
  `status` tinyint(3) UNSIGNED NOT NULL DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `tasks`
--

INSERT INTO `tasks` (`id`, `name`, `level_id`, `office_id`, `status`, `created_at`, `updated_at`) VALUES
(1, 'يوم مكتبي', 5, 1, 1, '2023-01-29 11:28:27', '2023-01-29 11:28:27'),
(2, 'إجازة', 5, 1, 1, '2023-01-29 11:28:27', '2023-01-29 11:28:27'),
(3, 'برنامج تدريبي', 5, 1, 1, '2023-01-29 11:28:27', '2023-01-29 11:28:27'),
(4, 'يوم مكتبي', 5, 2, 1, '2023-01-29 11:28:27', '2023-01-29 11:28:27'),
(5, 'إجازة', 5, 2, 1, '2023-01-29 11:28:27', '2023-01-29 11:28:27'),
(6, 'برنامج تدريبي', 5, 2, 1, '2023-01-29 11:28:27', '2023-01-29 11:28:27'),
(7, 'يوم مكتبي', 5, 3, 1, '2023-01-29 11:28:27', '2023-01-29 11:28:27'),
(8, 'إجازة', 5, 3, 1, '2023-01-29 11:28:27', '2023-01-29 11:28:27'),
(9, 'برنامج تدريبي', 5, 3, 1, '2023-01-29 11:28:27', '2023-01-29 11:28:27'),
(10, 'يوم مكتبي', 5, 4, 1, '2023-01-29 11:28:27', '2023-01-29 11:28:27'),
(11, 'إجازة', 5, 4, 1, '2023-01-29 11:28:27', '2023-01-29 11:28:27'),
(12, 'برنامج تدريبي', 5, 4, 1, '2023-01-29 11:28:27', '2023-01-29 11:28:27'),
(13, 'يوم مكتبي', 5, 5, 1, '2023-01-29 11:28:27', '2023-01-29 11:28:27'),
(14, 'إجازة', 5, 5, 1, '2023-01-29 11:28:27', '2023-01-29 11:28:27'),
(15, 'برنامج تدريبي', 5, 5, 1, '2023-01-29 11:28:27', '2023-01-29 11:28:27'),
(16, 'يوم مكتبي', 5, 6, 1, '2023-01-29 11:28:27', '2023-01-29 11:28:27'),
(17, 'إجازة', 5, 6, 1, '2023-01-29 11:28:27', '2023-01-29 11:28:27'),
(18, 'برنامج تدريبي', 5, 6, 1, '2023-01-29 11:28:27', '2023-01-29 11:28:27'),
(19, 'يوم مكتبي', 5, 7, 1, '2023-01-29 11:28:27', '2023-01-29 11:28:27'),
(20, 'إجازة', 5, 7, 1, '2023-01-29 11:28:27', '2023-01-29 11:28:27'),
(21, 'برنامج تدريبي', 5, 7, 1, '2023-01-29 11:28:27', '2023-01-29 11:28:27'),
(22, 'ابتدائية  ذوالنورين', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(23, 'ابتدائية الأمير محمد بن ناصر', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(24, 'ابتدائية السعودية', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(25, 'ابتدائية السويس', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(26, 'ابتدائية الشواجرة', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(27, 'ابتدائية الشيخ عيسى شماخي لتحفيظ القران الكريم ', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(28, 'ابتدائية العشوة', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(29, 'ابتدائية الفقهاء', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(30, 'ابتدائية الفيصلية', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(31, 'ابتدائية المثنى بن حارثة', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(32, 'ابتدائية المحمدية', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(33, 'ابتدائية المعبوج', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(34, 'ابتدائية المعرفه الأهلية', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(35, 'ابتدائية الملك عبد العزيز', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(36, 'ابتدائية الملك عبدالله بن عبدالعزيز', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(37, 'ابتدائية بخشة', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(38, 'ابتدائية بدر بالمقارية', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(39, 'ابتدائية حي الجبل', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(40, 'ابتدائية خالد بن الوليد', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(41, 'ابتدائية دار التوحيد', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(42, 'ابتدائية دحيقة', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(43, 'ابتدائية رياض جازان العالمية - بنين', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(44, 'ابتدائية رياض جازان المسار المصري', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(45, 'ابتدائية سلمان الفارسي', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(46, 'ابتدائية طارق بن زياد', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(47, 'ابتدائية عبدالله بن عباس', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(48, 'ابتدائية علوم جازان العالمية', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(49, 'ابتدائية علي بن أبي طالب', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(50, 'ابتدائية عمير والخرادلة', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(51, 'ابتدائية محلية', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(52, 'ابتدائية مدارس شركة مستقبل الاحفاد الاهلية', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(53, 'ابتدائية منارات المجد الاهلية', 1, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(54, 'متوسطة منارات المجد الأهلية', 2, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(55, 'متوسطة معاذ بن جبل', 2, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(56, 'متوسطة مستقبل الاحفاد الاهلية', 2, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(57, 'متوسطة محمد بن علي السنوسي', 2, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(58, 'متوسطة عمير والخرادلة', 2, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(59, 'متوسطة علوم جازان العالمية .', 2, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(60, 'متوسطة سلمان الفارسي', 2, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(61, 'متوسطة رياض جازان العالمية المصري', 2, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(62, 'متوسطة رياض جازان العالمية - بنين', 2, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(63, 'متوسطة دحيقة', 2, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(64, 'متوسطة دار التوحيد', 2, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(65, 'متوسطة حي الروضة', 2, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(66, 'متوسطة تحفيظ القران الكريم  بجازان', 2, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(67, 'متوسطة الملك فهد بمحلية', 2, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(68, 'متوسطة المعهد العلمي بجازان', 2, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(69, 'متوسطة المعرفة الاهلية', 2, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(70, 'متوسطة الفقهاء', 2, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(71, 'متوسطة الصفا', 2, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(72, 'متوسطة الشواجرة', 2, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(73, 'متوسطة الأندلس', 2, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(74, 'متوسطة الأمير محمد بن ناصر', 2, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(75, 'متوسطة أبو بكر الصديق', 2, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(76, 'متوسطة ابن سيناء', 2, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(77, 'ثانوية منارات المجد الاهلية ـ مقررات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(78, 'ثانوية منارات المجد الاهلية ـ - مسارات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(79, 'ثانوية معاذ بن جبل -مقررات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(80, 'ثانوية معاذ بن جبل - - مسارات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(81, 'ثانوية مستقبل الاحفاد الاهلية - مقررات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(82, 'ثانوية مستقبل الاحفاد الاهلية - مسارات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(83, 'ثانوية محمد بن علي السنوسي - مقررات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(84, 'ثانوية محمد بن علي السنوسي - مسارات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(85, 'ثانوية عمير والخرادلة - مقررات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(86, 'ثانوية عمير والخرادلة - مسارات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(87, 'ثانوية رياض جازان العالمية - المسار المصري', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(88, 'ثانوية دحيقة - مقررات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(89, 'ثانوية دحيقة - مسارات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(90, 'ثانوية الملك فهد بمحلية - مقررات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(91, 'ثانوية الملك فهد بمحلية - مسارات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(92, 'ثانوية المعهد العلمي بجازان', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(93, 'ثانوية المعرفة الأهلية - مقررات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(94, 'ثانوية المعرفة الأهلية - مسارات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(95, 'ثانوية الكربوس - مقررات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(96, 'ثانوية الكربوس - مسارات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(97, 'ثانوية الشواجرة - مقررات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(98, 'ثانوية الشواجرة - مسارات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(99, 'ثانوية الروضة بجازان - مقررات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(100, 'ثانوية الروضة بجازان - مسارات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(101, 'ثانوية الرازي - مقررات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(102, 'ثانوية الرازي - مسارات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(103, 'ثانوية الخوارزمي - مقررات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(104, 'ثانوية الخوارزمي - مسارات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(105, 'ثانوية الأمير فيصل بن عبدالله - مقررات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(106, 'ثانوية الأمير فيصل بن عبدالله - مسارات', 3, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(107, 'ابتدائية  ذوالنورين وابتدائية علي بن أبي طالب', 4, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(108, 'ابتدائية ومتوسطة الأمير محمد بن ناصر', 4, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(109, 'ابتدائية السعودية وابتدائية عبدالله بن عباس', 4, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(110, 'ابتدائية السويس ومتوسطة معاذ بن جبل وثانوية الأمير فيصل بن عبدالله', 4, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(111, 'ابتدائية ومتوسطة وثانوية الشواجرة', 4, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(112, 'ابتدائية الشيخ عيسى شماخي لتحفيظ القران الكريم ومتوسطة تحفيظ القران الكريم بجازان', 4, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(113, 'ابتدائية ومتوسطة الفقهاء', 4, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(114, 'ابتدائية المثنى بن حارثة ومتوسطة أبوبكر الصديق', 4, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(115, 'ابتدائية خالد بن الوليد وابتدائية ومتوسطة دار التوحيد', 4, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(116, 'ابتدائية ومتوسطة رياض جازان العالمية - بنين', 4, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(117, 'ابتدائية ومتوسطة سلمان الفارسي', 4, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(118, 'ابتدائية طارق بن زياد ومتوسطة الصفا', 4, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(119, 'ابتدائية ومتوسطة علوم جازان العالمية', 4, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(120, 'ابتدائية ومتوسطة وثانوية عمير والخرادلة', 4, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(121, 'ابتدائية ومتوسطة منارات المجد الاهلية', 4, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(122, 'متوسطة وثانوية محمد بن علي السنوسي', 4, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(123, 'متوسطة وثانوية دحيقة', 4, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(124, 'متوسطة وثانوية الملك فهد بمحلية', 4, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(125, 'متوسطة وثانوية المعهد العلمي بجازان', 4, 1, 1, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(126, 'مدارس مكتب فرسان', 4, 1, 1, NULL, '2023-01-29 15:11:32');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `tasks`
--
ALTER TABLE `tasks`
  ADD PRIMARY KEY (`id`),
  ADD KEY `tasks_level_id_foreign` (`level_id`),
  ADD KEY `tasks_office_id_foreign` (`office_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `tasks`
--
ALTER TABLE `tasks`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=149;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `tasks`
--
ALTER TABLE `tasks`
  ADD CONSTRAINT `tasks_level_id_foreign` FOREIGN KEY (`level_id`) REFERENCES `levels` (`id`),
  ADD CONSTRAINT `tasks_office_id_foreign` FOREIGN KEY (`office_id`) REFERENCES `offices` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
